{
  "backend/main.mo": "Motoko actor implementing a social app backend with user creation, post creation (with optional base64 image), banana reactions, and follow/unfollow functionality using in-memory Maps.",
  "feature_evidence.json": "Feature evidence report confirming that the logo/Om symbol was removed from the Navigation component and replaced with plain text branding.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role and recent changes in the project.",
  "frontend/index.css": "Tailwind base CSS with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point titled 'Banana Social App' that mounts the React app via a root div and a module script pointing to src/main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for `/feed` and `/profile/$userId`, a root layout wrapping all routes, and a redirect from `/` to `/feed`.",
  "frontend/src/components/ComposePost.tsx": "Post composition component with a textarea, character counter, image attachment (1 MB max, JPEG/PNG/GIF/WebP), base64 preview with removal, and submission passing both content and base64 image to the parent callback.",
  "frontend/src/components/CreateProfileModal.tsx": "Modal dialog for new users to enter a username and pick an avatar emoji, with validation and error display, calling a `createUser` callback on submit.",
  "frontend/src/components/Footer.tsx": "App footer displaying the current year, banana emoji branding, and a caffeine.ai attribution link with UTM parameters.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders Navigation at the top, a flexible main content area, and Footer at the bottom in a full-height flex column.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with plain text 'BananaSocial' branding, a Feed link, and a Profile link (shown when the principal is available) using TanStack Router typed routing.",
  "frontend/src/components/PostCard.tsx": "Renders a single post card with author avatar, username, content, optional image, timestamp, and a banana reaction button with optimistic animation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Custom hook that fetches the currently authenticated user from the backend and exposes a mutation to create a new user profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, wrapping DFINITY's AuthClient to expose login, logout, and identity state to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for posts and users, including fetching, creating, reacting to posts, and following/unfollowing users with optimistic updates.",
  "frontend/src/index.css": "Defines global styles, Tailwind imports, and a full set of CSS custom properties for the Banana Social light and dark themes including typography, color tokens, and shadow utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page that displays posts with their authors, a compose box, a banner, and conditionally shows a create-profile modal for new users.",
  "frontend/src/pages/ProfilePage.tsx": "React page component that displays a user's profile, their posts, and follow/unfollow controls, fetching data via custom query hooks and resolving the user by Principal ID from the route params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (banana color palette, fonts, shadows, border radii, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, existing features, and configuration for a task to remove the logo graphic from the navigation component and replace it with plain text branding."
}