{
  "backend/main.mo": "Motoko actor implementing a social app backend with user creation, post creation, banana reactions, and follow/unfollow functionality using mutable Maps for storage.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (global feed, compose post, profile page, visual theme) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose of every component, hook, page, and config file in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, card, chart colors, sidebar) using OKLCH values.",
  "frontend/index.html": "Minimal HTML entry point titled 'Banana Social App' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with routes for `/feed` and `/profile/$userId`, wraps all routes in a Layout, and redirects `/` to `/feed`.",
  "frontend/src/components/ComposePost.tsx": "Post composition component with a textarea (280-character limit with color-coded counter), banana-themed submit button, and Cmd/Ctrl+Enter keyboard shortcut support.",
  "frontend/src/components/CreateProfileModal.tsx": "Modal dialog for new users to create a profile by entering a username and selecting an avatar emoji from a predefined grid, with validation and error display.",
  "frontend/src/components/Footer.tsx": "App footer displaying the BananaSocial copyright, banana emoji branding, and a caffeine.ai attribution link with dynamic UTM tracking based on the current hostname.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component that renders the Navigation bar and Footer around a full-height flex-column main content area.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, Feed link, and a Profile link that resolves the current user's principal from the actor's agent.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author avatar, username, timestamp, content, and a banana-reaction button with optimistic animation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook that fetches the logged-in user from the backend using the actor's principal, and exposes a mutation to create a new user profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, clear, identity, status) via a React context and AuthClient, with idle handling disabled by default.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations: fetching/creating posts, reacting to posts, and fetching/creating/following/unfollowing users.",
  "frontend/src/index.css": "Global stylesheet importing Nunito fonts and defining Tailwind base/utility layers with a banana-themed light and dark color token system using OKLCH variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page that displays all posts in reverse-chronological order with a compose box, banana reaction buttons, and a create-profile modal for new users. Fetches post authors in bulk and determines the current user's principal to manage profile creation flow.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that shows a user's avatar, username, follower/following counts, and their posts, with a follow/unfollow toggle button. Parses the userId route param as a Principal and uses query hooks to load profile data and the current user's following list.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the banana-themed color palette (using OKLCH variables), custom fonts (Nunito/Nunito Sans), extended border radii, box shadows, and keyframe animations including a banana-bounce effect.",
  "project_state.json": "Project state manifest tracking the current version, feature inventory, known issues, and pending action requests for the banana-themed social platform built with React and Motoko on ICP."
}